<template>
  <div class="page container">
    <div class="page__breadcrumbs">
      <Breadcrumbs
        :items="[{ text: 'Главная', to: '/' }, { text: 'О компании' }]"
      />
    </div>
    <div class="page__content">
      <div class="content">
        <h1>О компании</h1>
        <p>
          Весь, товар, представленный на сайте digitalsquare.ru официально
          поставляется в Россию и имеет гарантию производителя. Гарантия
          составляет 1 год с момента покупки, о чем указано в товарном чеке,
          прилагаемом к заказу.
        </p>
        <p>
          По вопросам, касающимся использования товара или при наступлении
          гарантийного случая вы можете обратиться в нашу службу поддержки по
          электронной почте
          <a href="mailto:support@digitalsquare.ru">support@digitalsquare.ru</a
          >.
        </p>
        <p>
          В целях ускорения рассмотрения гарантийных случаев мы просим вас
          предоставить как можно более подробное описание проблемы и фотографии
          товара, а также отсканированные образцы печати. Если у вас нет
          возможности предоставить нам фотографии или отсканировать результат
          печати, вы можете обратиться по гарантии в общем порядке, направив
          товар и необходимые документы Почтой.
        </p>
        <p>
          Внимание! Вскрытие картриджа с любой целью ведет к потере гарантии на
          картридж. Пожалуйста, не вскрывайте картридж.
        </p>
        <p>
          Внимание! После заправки картриджа, гарантия на картридж не
          действительна. Наша компания не несет ответственности за тонер,
          которым вновь заправляется картридж и качество процесса заправки.
        </p>
        <p>
          Внимание! Гарантия не распространяется на товар, у которого исчерпан
          ресурс печати (закончился тонер или чернила).
        </p>
        <p>
          Мы заботимся о качестве нашей продукции и хотим знать о ваших
          замечаниях и предложениях. Любые замечания и предложения просим
          отправлять нам по электронной почте с как можно более подробным
          описанием.
        </p>
        <h2>1. Порядок получения товара</h2>
        <p>
          1. При получении товара покупатель должен проверить количество и
          номенклатуру товара, целостность упаковки и отсутствие механических
          повреждений. В соответствии со ст. 459 ч.1 ГК РФ (также ст.211 ГК РФ),
          претензии по внешнему виду доставленного покупателю товара можно
          предъявить только до момента передачи ему товара продавцом;
        </p>
        <p>
          2. В случае отсутствия претензий покупатель производит оплату товара и
          услуг по доставке. После этого курьер передает покупателю: <br />
          - товар; <br />
          - кассовый чек (при оплате за наличный расчет);
        </p>
        <p>
          3. Допускается вскрытие транспортной упаковки для обеспечения доступа
          к товару.
        </p>
        <p>
          Внимание! Вскрытие герметичной упаковки товара и его использование без
          оплаты не допускается! Это приводит к нарушению товарного вида и
          потере его потребительских свойств.
        </p>
        <p>
          Внимание! При отказе от получения товара расходы по доставке товара от
          получателя на склад продавца оплачиваются покупателем (п.21 Правил о
          продаже товаров дистанционным способом)
        </p>
        <h2>2. Обмен и возврат товара</h2>
        <p>
          В соответствии с нормами действующего законодательства Российской
          Федерации, регулирующего вопросы по защите прав потребителей, при
          соблюдении определенных данным законодательством условий, потребитель
          вправе потребовать от продавца (изготовителя):
        </p>
        <p>1. заменить товар ненадлежащего качества;</p>
        <p>
          2. обменять не подошедший по каким-либо характеристикам товар
          надлежащего качества на другой товар (в течение 7 дней со дня
          приобретения товара);
        </p>
        <p>
          3. отказаться от исполнения договора купли-продажи и, возвратив товар,
          потребовать возврата уплаченной за товар денежной суммы (в течение 7
          дней со дня приобретения товара).
        </p>
        <h3>2.1. Товар надлежащего качества</h3>
        <p>
          Обмен и возврат товара надлежащего качества производится в течении 7
          дней с момента получения.
        </p>
        <p>
          Обмен и возврат товара надлежащего качества возможен только в случае,
          если сохранены его товарный вид (невскрытые упаковка, защитный
          герметичный пакет, защитная лента/ бумага, отсутствие следов
          использования картриджа), потребительские свойства (сохранен
          первоначальный реурс картриджа), а также документ, подтверждающий факт
          и условия покупки указанного товара(товарный или кассовый чек). При
          отказе потребителя от товара продавец должен возвратить ему денежную
          сумму, уплаченную потребителем за товар по договору, за исключением
          расходов продавца на доставку от потребителя возвращенного товара, не
          позднее чем через десять дней со дня предъявления потребителем
          соответствующего требования.
        </p>
        <h3>2.2. Товар ненадлежащего качества</h3>
        <p>
          В случае обнаружения покупателем недостатков в товаре и предъявления
          требований о его замене продавец обязан заменить такой товар на новый.
          Если в момент предъявления данного требования у продавца отсутствует
          необходимый для замены товар, замена должна быть проведена в течение
          месяца со дня предъявления такого требования.
        </p>
        <p>
          По письменному требованию покупателя продавец обязан вернуть
          покупателю уплаченные им денежные средства за товар ненадлежащего
          качества, а также возместить расходы на доставку товара до покупателя
          и обратно. Как правило при признании гарантийного случая возврат
          товара ненадлежащего качества продавцу не требуется, такой товар
          подлежит утилизации.
        </p>
      </div>
    </div>
  </div>
</template>
