<template>
  <div class="answers">
    <div class="answers__form">
      <AnswersForm />
    </div>
    <div class="answers__list">
      <AnswersItem v-for="answer in answers" v-bind="answer" :key="answer.id" />
    </div>
  </div>
</template>

<script lang="ts" setup>
const answers = reactive([
  {
    id: 1,
    author: "Карина",
    date: "22.01.2016",
    question: "Как узнать, подойдёт ли картридж к моему принтеру?",
    answer: `
        Чтобы узнать, подойдет ли картридж, используйте 
        модель принтера (самый надежный способ!) для поиска на сайте производителя или в магазинах, 
        посмотрите наклейки в отсеке карт или на старых картриджах. Чтобы узнать, подойдет ли картридж, используйте 
        модель принтера (самый надежный способ!) для поиска на сайте производителя или в магазинах, 
        посмотрите наклейки в отсеке карт или на старых картриджах. Чтобы узнать, подойдет ли картридж, используйте 
        модель принтера (самый надежный способ!) для поиска на сайте производителя или в магазинах, 
        посмотрите наклейки в отсеке карт или на старых картриджах
    `,
  },
  {
    id: 2,
    author: "Vasya",
    date: "22.01.2022",
    question: "Как узнать, подойдёт ли картридж к моему принтеру?",
    answer: `
        Чтобы узнать, подойдет ли картридж, используйте 
        модель принтера (самый надежный способ!) для поиска на сайте производителя или в магазинах, 
        посмотрите наклейки в отсеке карт или на старых картриджах. Чтобы узнать, подойдет ли картридж, используйте 
        модель принтера (самый надежный способ!) для поиска на сайте производителя или в магазинах, 
        посмотрите наклейки в отсеке карт или на старых картриджах. Чтобы узнать, подойдет ли картридж, используйте 
        модель принтера (самый надежный способ!) для поиска на сайте производителя или в магазинах, 
        посмотрите наклейки в отсеке карт или на старых картриджах
    `,
  },
]);
</script>

<style lang="scss" scoped>
.answers {
  &__form {
    margin-bottom: 30px;
  }
  &__list {
    display: flex;
    flex-direction: column;
    gap: 10px;
  }
}
</style>
